1 exe

In [1]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)

In [ ]:
#1
df = df.rename(columns={"First Name":"first_name", "Age": "age"})

In [ ]:
#2
df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [ ]:
#3
mean1 = df.age.mean()
print(mean1)

32.5

In [7]:
#4
print(df[['first_name', 'City']])

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [9]:
#5
df['Salary'] = [1200, 3200, 3500, 4900]
df

  first_name  age           City  Salary
0      Alice   25       New York    1200
1        Bob   30  San Francisco    3200
2    Charlie   35    Los Angeles    3500
3      David   40        Chicago    4900

In [11]:
#6
summary = df.describe()
summary

             age       Salary
count   4.000000     4.000000
mean   32.500000  3200.000000
std     6.454972  1525.341492
min    25.000000  1200.000000
25%    28.750000  2700.000000
50%    32.500000  3350.000000
75%    36.250000  3850.000000
max    40.000000  4900.000000

2 exe

In [12]:
month = ['Jan', 'Feb', 'Mar', 'Apr']
sales = [5000, 6000, 7500, 8000]
expenses = [3000, 3500, 4000, 4500]

info = pd.DataFrame({"Month":month, "Sales": sales, "Expenses":expenses})
info

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [16]:

Sales_max = info.Sales.max()
print(f'Sales max {Sales_max}')
exp_max = info.Expenses.max()
print(f'Expenses max {exp_max}\n')

Sales_min = info.Sales.min()
print(f'Sales min {Sales_min}')
exp_min = info.Expenses.min()
print(f'Expenses min {exp_min}\n')

Sales_mean = info.Sales.mean()
print(f'Sales avg {Sales_mean}')
exp_mean = info.Expenses.mean()
print(f'Expenses avg {exp_mean}')

Sales max 8000
Expenses max 4500

Sales min 5000
Expenses min 3000

Sales avg 6625.0
Expenses avg 3750.0